import React from "react";
import './Top.css';

function Top(){
    return (
        <div className="component-top">
            <div className="prologue">
                <p className="sentence">
                    とおいとおい宇宙のとあるところに、いきものが住んでいました。 <br />
                    そのいきものたちは私たちの星で見たことのある姿をしていました。<br />
                    <br />
                    あるとき、『門』を通ってやってきた1人の『人間』によっていきものたちに文明が与えられました。<br />
                    いきものたちは彼に感謝を示し、彼といきものたちは友達になりました。<br />
                    <br />
                    彼が寿命で眠りについたころ。別の、大勢の『人間』が訪れました。<br />
                    大きな船に乗って現れたそれはいきものたちを捕らえて、見世物として売ってしまおうとしました。<br />
                    死にものぐるいで逃げたいきものたちは、彼が眠る庭園で祈りました。<br />
                    <br />
                    「友達を助けたい」<br />
                    言葉が彼に届いたのか、はたまた神の気まぐれか。<br />
                    いきものたちの姿は彼に近い『人間』の形を取りました。<br />
                    彼に教わった方法で、彼と同じ姿で戦ったいきものたちは無事に仲間を救い出し、悪い『人間』を追い返したのでした。<br />
                    <br />
                    彼に彼は星の創造主と近い姿をいきものたちに与えられ、神として称えられました。<br />
                    彼はいつまでもかの星を見守るのでした。<br />
                    <br />
                    <br />
                    <br />
                    月日が流れて現代。今では国が生まれ、技術やルールや宗教も発展し、多少問題も起きたけど...それでもいきものたちは世代を重ねて生きてきました。<br />
                    <br />
                    もともと暮らしていたいきものたちも、どこかで見た動植物も、そしてここに迷い込んだ者も。等しくこの星は受け入れます。<br />
                    これはそんな『擬人』となった彼女たちの日常。あの亭で彼が見た世界───私たちも、ちょっとだけ見物しましょうか。
                    </p>
            </div>
        </div>
    )
}

export default Top;