import React from "react";
import './Top.css';

function Top(){
    return (
        <div className="component-top">
            <div className="prologue">
                <p className="sentence">
                    昔々とおいとおい宇宙のとあるところに 「見たことがあるけど見たことのないいきもの」がいました。<br />
                    いきものは自分の形というものを持っていませんでした。<br />
                    <br />
                    あるとき、大きな大きな船が大波とともにこの星に突然現れました。その中にはたくさんの動物と8人のヒトが乗っていました。<br />
                    彼らと動物たちはいきものたちと心を通わせ、自分たちが持つ文明の知識を分け与えました。<br />
                    いきものたちは感謝の証として彼らや動物たちと同じ姿、混ぜた姿をとりました。ヒトはいきものたちを「擬人」と呼びました。<br />
                    <br />
                    時が来て彼らがいるべき場所に帰った後。<br />
                    彼らと同じように大きな波を伴って、たくさんの船に乗った大勢の別のヒトが現れました。<br />
                    彼らは大陸を占拠し、擬人たちを見せ物などにするために連れ帰ろうとしました。<br />
                    <br />
                    あれがわるいヒトか、仲間を助けなきゃ<br />
                    擬人たちは先に来たヒトの老人からいいものとわるいものの見分け方と対処を教わっていました。<br />
                    <br />
                    彼に教わった方法で、彼と同じ姿で戦った擬人たちは無事に仲間を救い出し「わるいヒト」を追い返したのでした。<br />
                    <br />
                    月日が流れて現代。 <br />
                    この話は昔話、おとぎ話として皆が知る教訓となっています。<br />
                    今ではこの星も地球と似ているようでどこかが違う文明を持ち、数々の国や集落が生まれました。<br />
                    時々こちらへ迷い込むヒトや動物たちも受け入れられる様になり、またそれの対策もされるようになりました。<br />
                    <br />
                    これはそんな世界の中で起きたお話。<br />
                    今日も何か起きているかもしれません。
                    </p>
            </div>
        </div>
    )
}

export default Top;